{
  "title": "Reticulum Overview",
  "sections": [
    {
      "id": "why-reticulum",
      "title": "Why Reticulum",
      "content": "<p>Every communication system you rely on has a single point of failure. Cell towers. Internet service providers. DNS servers. Government kill switches. When infrastructure goes down—through disaster, conflict, or deliberate action—so does your ability to coordinate, share intelligence, or call for help.</p><p>Reticulum eliminates these dependencies. It creates encrypted mesh networks over whatever physical medium is available: a $35 LoRa radio, an HF transceiver, a WiFi router, or all of them simultaneously. No accounts. No servers. No permissions. If two devices can exchange bits, they can form a Reticulum network.</p><div class='alert alert-info'><strong>Bottom Line:</strong> Reticulum gives you sovereign communications. You control the network because you ARE the network.</div>"
    },
    {
      "id": "what-it-does",
      "title": "What It Actually Does",
      "content": "<p>Reticulum handles three problems that normally require infrastructure:</p><h4>1. Identity Without Registration</h4><p>Your identity is a cryptographic keypair generated locally. No email, no phone number, no account creation. Share your public destination hash and anyone can send you encrypted messages. Lose your device? Generate a new identity in seconds.</p><h4>2. Routing Without Servers</h4><p>Messages find their destination through a gossip protocol. Each node remembers where it heard about other nodes. No routing tables, no central directory. The network self-heals as nodes join and leave.</p><h4>3. Encryption Without Trust</h4><p>Every link uses ephemeral keys negotiated via X25519 ECDH. Even if someone captures your traffic today, they can't decrypt it tomorrow. No certificates, no certificate authorities, no trust decisions.</p>"
    },
    {
      "id": "what-you-can-build",
      "title": "What You Can Build",
      "content": "<h4>Messaging (LXMF)</h4><p>Encrypted messages that work like email but over any transport. Messages store-and-forward through propagation nodes when recipients are offline. Works over LoRa at 300 bps or fiber at gigabit speeds—same protocol.</p><h4>Information Nodes (NomadNet)</h4><p>Host pages and files accessible to anyone on the network. Think websites, but they work over HF radio. The LFM node at <code>2eabad04f9145d32a6a3eda285d66c39</code> hosts articles, tools, and a chat room bridged to Matrix—all accessible from a terminal over mesh.</p><h4>Custom Applications</h4><p>Build anything that needs secure point-to-point communication. File transfer. Remote command execution. We built LXMFMonero—a system that sends Monero transactions over Reticulum, verified working over I2P and TCP testnets.</p>"
    },
    {
      "id": "limitations",
      "title": "Know the Limitations",
      "content": "<div class='alert alert-warning'><strong>Not Magic:</strong> Reticulum solves network problems, not physics problems.</div><h4>Radio Still Has Physics</h4><p>LoRa at 915 MHz gives you maybe 10km line-of-sight with good antennas. Vegetation, terrain, and buildings eat signal. HF can bounce worldwide, but it's slow and requires a license. Reticulum makes these links encrypted and routable—it doesn't make them faster or longer.</p><h4>Low Bandwidth is Really Low</h4><p>A LoRa link at SF10 gives you roughly 1 kbps. That's 125 bytes per second. Text messages: fine. Images: painful. Video: impossible. Design your applications accordingly.</p><h4>No Anonymity Guarantee</h4><p>Reticulum provides initiator anonymity in the protocol—packets don't contain source addresses. But if you're transmitting RF, you can be direction-found. For anonymity, route through I2P or use the network from locations you're not connected to.</p><h4>Not Audited</h4><p>The cryptography follows best practices, but Reticulum hasn't had a formal security audit. Don't use it for anything where a compromise means prison or death. Yet.</p>"
    },
    {
      "id": "quick-start",
      "title": "Get Running in 5 Minutes",
      "content": "<h4>Install (Linux/macOS)</h4><pre><code># Option 1: pipx (recommended)\npipx install rns\n\n# Option 2: venv\npython3 -m venv ~/.rns-venv\nsource ~/.rns-venv/bin/activate\npip install rns</code></pre><p><strong>Note:</strong> Direct <code>pip install</code> fails on most modern systems (PEP 668). Use pipx or a venv.</p><p>First run creates <code>~/.reticulum/config</code> with a default AutoInterface. You're now a Reticulum node.</p><h4>Verify</h4><pre><code>rnstatus</code></pre><h4>Connect to Public Network</h4><p>Add to <code>~/.reticulum/config</code> under <code>[interfaces]</code>:</p><pre><code>[[RNS Testnet Amsterdam]]\n  type = TCPClientInterface\n  enabled = yes\n  target_host = amsterdam.connect.reticulum.network\n  target_port = 4965</code></pre><p>Other active nodes: <code>rns.beleth.net:4242</code>, <code>rns.chicagonomad.net:4242</code>. Check <code>rmap.world</code> for live status.</p><h4>Find the LFM Node</h4><pre><code>rnpath 2eabad04f9145d32a6a3eda285d66c39</code></pre><p>Should return: Path found, destination is X hops away</p><h4>Install NomadNet</h4><pre><code>pipx install nomadnet\nnomadnet</code></pre><p>Press Ctrl+L, paste <code>2eabad04f9145d32a6a3eda285d66c39</code>, connect.</p>"
    },
    {
      "id": "architecture",
      "title": "How It Works (Condensed)",
      "content": "<h4>Identities</h4><p>Ed25519 keypairs. Your public key hash is your address. 16 bytes, displayed as 32 hex characters.</p><h4>Destinations</h4><p>Addresses you can send to. Four types: Single (encrypted to one recipient), Group (symmetric key for multiple recipients), Plain (unencrypted broadcast), Link (established channels).</p><h4>Announces</h4><p>Nodes broadcast their presence periodically. Other nodes cache this information to build routing knowledge. No central directory—the network learns organically.</p><h4>Links</h4><p>Bidirectional encrypted channels between two identities. Three packets to establish (297 bytes total). Used for streaming data, file transfers, or interactive sessions.</p><h4>Transport</h4><p>Any node can forward packets for others by enabling transport. This extends network reach but isn't required. Most deployments need few transport nodes—too many degrades performance.</p>"
    },
    {
      "id": "ecosystem",
      "title": "The Ecosystem",
      "content": "<table><thead><tr><th>Component</th><th>Purpose</th><th>Version</th><th>Released</th></tr></thead><tbody><tr><td><strong>Reticulum (rns)</strong></td><td>Core network stack</td><td>1.0.4</td><td>Nov 22, 2025</td></tr><tr><td><strong>LXMF</strong></td><td>Message format and delivery</td><td>0.9.3</td><td>Nov 13, 2025</td></tr><tr><td><strong>NomadNet</strong></td><td>Terminal client, node hosting</td><td>0.9.1</td><td>Nov 3, 2025</td></tr><tr><td><strong>Sideband</strong></td><td>GUI client (Android/Desktop)</td><td>1.8.2</td><td>Nov 28, 2025</td></tr><tr><td><strong>MeshChat</strong></td><td>Web-based client</td><td>2.3.0</td><td>Nov 11, 2025</td></tr><tr><td><strong>RNode Firmware</strong></td><td>LoRa transceiver firmware</td><td>1.85</td><td>Nov 2025</td></tr></tbody></table><p>Reticulum, LXMF, NomadNet, Sideband, and RNode maintained by Mark Qvist. MeshChat by Liam Cottle. All open source. All interoperable.</p><p><em>Versions verified from GitHub releases, December 11, 2025</em></p>"
    },
    {
      "id": "lfm-infrastructure",
      "title": "LFM Infrastructure",
      "content": "<p>We run production Reticulum infrastructure you can use:</p><div class='key-points'><div class='key-point'><span class='label'>NomadNet Node</span><span class='value'><code>2eabad04f9145d32a6a3eda285d66c39</code></span></div><div class='key-point'><span class='label'>LXMF Propagation</span><span class='value'><code>a21f547bc1f70043a28c4e2d5b04e570</code></span></div><div class='key-point'><span class='label'>I2P Server</span><span class='value'><code>kfamlmwnlw3acqfxip4x6kt53i2tr4ksp5h4qxwvxhoq7mchpolq.b32.i2p</code></span></div></div><p>The node hosts 16 pages: articles, project info, live data feeds (crypto prices, HF propagation, GitHub activity), calculators, and a Quick Chat room bridged to our Matrix server.</p><p>The propagation node stores messages for offline recipients. Configure it in Sideband or NomadNet to receive messages when you're not connected.</p><p>Accessible via any public TCP transport node or I2P.</p>"
    }
  ]
}
